assignment2/part6/Re=20/system/BlockMeshDict
FoamFile
{
    version  2.0;
    format   ascii; 
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices
( 	(0.5 0.0 0)
	(0.354 0.354 0)
	(0.0 0.5 0)
	(-0.354 0.354 0)
	(-0.5 0.0 0)
	(-0.354 -0.354 0)
	(-0.0 -0.5 0)
	(0.354 -0.354 0)
	(1.5 0.0 0)
	(1.061 1.061 0)
	(0.0 1.5 0)
	(-1.061 1.061 0)
	(-1.5 0.0 0)
	(-1.061 -1.061 0)
	(-0.0 -1.5 0)
	(1.061 -1.061 0)
	(5.0 0.0 0)
	(5.0 1.061 0)
	(5.0 5.0 0)
	(1.061 5.0 0)
	(0.0 5.0 0)
	(-1.061 5.0 0)
	(-5.0 5.0 0)
	(-5.0 1.061 0)
	(-5.0 0.0 0)
	(-5.0 -1.061 0)
	(-5.0 -5.0 0)
	(-1.061 -5.0 0)
	(0.0 -5.0 0)
	(1.061 -5.0 0)
	(5.0 -5.0 0)
	(5.0 -1.061 0)
	(0.5 0.0 1)
	(0.354 0.354 1)
	(0.0 0.5 1)
	(-0.354 0.354 1)
	(-0.5 0.0 1)
	(-0.354 -0.354 1)
	(-0.0 -0.5 1)
	(0.354 -0.354 1)
	(1.5 0.0 1)
	(1.061 1.061 1)
	(0.0 1.5 1)
	(-1.061 1.061 1)
	(-1.5 0.0 1)
	(-1.061 -1.061 1)
	(-0.0 -1.5 1)
	(1.061 -1.061 1)
	(5.0 0.0 1)
	(5.0 1.061 1)
	(5.0 5.0 1)
	(1.061 5.0 1)
	(0.0 5.0 1)
	(-1.061 5.0 1)
	(-5.0 5.0 1)
	(-5.0 1.061 1)
	(-5.0 0.0 1)
	(-5.0 -1.061 1)
	(-5.0 -5.0 1)
	(-1.061 -5.0 1)
	(0.0 -5.0 1)
	(1.061 -5.0 1)
	(5.0 -5.0 1)
	(5.0 -1.061 1)

);

blocks
(
	hex (0 8 9 1 32 40 41 33) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (8 16 17 9 40 48 49 41) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (9 17 18 19 41 49 50 51) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (9 19 20 10 41 51 52 42) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (10 20 21 11 42 52 53 43) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (11 21 22 23 43 53 54 55) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (11 23 24 12 43 55 56 44) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (12 24 25 13 44 56 57 45) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (13 25 26 27 45 57 58 59) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (13 27 28 14 45 59 60 46) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (14 28 29 15 46 60 61 47) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (15 29 30 31 47 61 62 63) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (15 31 16 8 47 63 48 40) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (1 9 10 2 33 41 42 34) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (2 10 11 3 34 42 43 35) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (3 11 12 4 35 43 44 36) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (4 12 13 5 36 44 45 37) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (5 13 14 6 37 45 46 38) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (6 14 15 7 38 46 47 39) (10 10 1) simpleGrading (1.0 1.0 1.0) 
	hex (7 15 8 0 39 47 40 32) (10 10 1) simpleGrading (1.0 1.0 1.0) 
);

edges
(	arc 0 1 (0.462 0.191 0)
	arc 32 33 (0.462 0.191 1)
	arc 8 9 (1.386 0.574 0)
	arc 40 41 (1.386 0.574 1)
	arc 1 2 (0.192 0.463 0)
	arc 33 34 (0.192 0.463 1)
	arc 9 10 (0.574 1.386 0)
	arc 41 42 (0.574 1.386 1)
	arc 2 3 (-0.191 0.462 0)
	arc 34 35 (-0.191 0.462 1)
	arc 10 11 (-0.574 1.386 0)
	arc 42 43 (-0.574 1.386 1)
	arc 3 4 (-0.463 0.192 0)
	arc 35 36 (-0.463 0.192 1)
	arc 11 12 (-1.386 0.574 0)
	arc 43 44 (-1.386 0.574 1)
	arc 4 5 (-0.462 -0.191 0)
	arc 36 37 (-0.462 -0.191 1)
	arc 12 13 (-1.386 -0.574 0)
	arc 44 45 (-1.386 -0.574 1)
	arc 5 6 (-0.192 -0.463 0)
	arc 37 38 (-0.192 -0.463 1)
	arc 13 14 (-0.574 -1.386 0)
	arc 45 46 (-0.574 -1.386 1)
	arc 6 7 (0.191 -0.462 0)
	arc 38 39 (0.191 -0.462 1)
	arc 14 15 (0.574 -1.386 0)
	arc 46 47 (0.574 -1.386 1)
	arc 7 0 (0.463 -0.192 0)
	arc 39 32 (0.463 -0.192 1)
	arc 15 8 (1.386 -0.574 0)
	arc 47 40 (1.386 -0.574 1)

);

boundary
(

  inlet
  {
      type patch;
      faces
      (
		(27 26 58 59)
		(27 59 60 28)
		(28 60 61 29)
		(29 61 62 30)
 
      );
  }

  outlet
  {
      type patch;
      faces
      (
		(19 18 50 51)
		(19 51 52 20)
		(20 52 53 21)
		(21 53 54 22)

      );
  }

  cylinder
  {
      type wall;
      faces
      (
		(0 32 33 1)
		(1 33 34 2)
		(2 34 35 3)
		(3 35 36 4)
		(4 36 37 5)
		(5 37 38 6)
		(6 38 39 7)
		(7 39 32 0)

      );
  }

  top
  {
      type symmetryPlane;
      faces
      (

		(16 48 49 17)
		(17 49 50 18)
		(31 30 62 63)
		(31 63 48 16)

      );
  }

  bottom
  {
      type symmetryPlane;
      faces
      (

		(23 22 54 55)
		(23 55 56 24)
		(24 56 57 25)
		(25 57 58 26)

      );
  }

);
